---
kind: property
id: P:Autodesk.Revit.DB.WallSweepInfo.IsVertical
source: html/c4db2a9f-d814-a844-1df1-301b0e4f94d2.htm
---
# Autodesk.Revit.DB.WallSweepInfo.IsVertical Property

Indicates whether the sweep or reveal is swept vertically or horizontally.

## Syntax (C#)
```csharp
public bool IsVertical { get; }
```

## Remarks
Wall sweeps defined as a part of a vertical compound structure will always be horizontal.